### Cleaning Data
Casting Datatypes and Handling Missing Values

In [1]:
import pandas as pd
import numpy as np

In [2]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'],
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'],
    'email': ['CoreyMSSchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com', None, np.nan, 'Anonymous@gmail.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                     email      age
0  Corey  Schafer  CoreyMSSchafer@gmail.com       33
1   Jane      Doe         JaneDoe@gmail.com       55
2   John      Doe         JohnDoe@gmail.com       63
3  Chris  Schafer                      None       36
4    NaN      NaN                       NaN     None
5   None      NaN       Anonymous@gmail.com     None
6     NA  Missing                        NA  Missing

In [5]:
df.dropna()

   first     last                     email      age
0  Corey  Schafer  CoreyMSSchafer@gmail.com       33
1   Jane      Doe         JaneDoe@gmail.com       55
2   John      Doe         JohnDoe@gmail.com       63
6     NA  Missing                        NA  Missing

In [6]:
df.dropna(axis='index', how='any') # Default

   first     last                     email      age
0  Corey  Schafer  CoreyMSSchafer@gmail.com       33
1   Jane      Doe         JaneDoe@gmail.com       55
2   John      Doe         JohnDoe@gmail.com       63
6     NA  Missing                        NA  Missing

In [7]:
df.dropna(axis='index', how='all')

   first     last                     email      age
0  Corey  Schafer  CoreyMSSchafer@gmail.com       33
1   Jane      Doe         JaneDoe@gmail.com       55
2   John      Doe         JohnDoe@gmail.com       63
3  Chris  Schafer                      None       36
5   None      NaN       Anonymous@gmail.com     None
6     NA  Missing                        NA  Missing

In [8]:
df.dropna(axis='columns', how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [9]:
df.dropna(axis='index', how='any', subset=['email'])

   first     last                     email      age
0  Corey  Schafer  CoreyMSSchafer@gmail.com       33
1   Jane      Doe         JaneDoe@gmail.com       55
2   John      Doe         JohnDoe@gmail.com       63
5   None      NaN       Anonymous@gmail.com     None
6     NA  Missing                        NA  Missing

In [10]:
df.dropna(axis='index', how='all', subset=['last','email'])

   first     last                     email      age
0  Corey  Schafer  CoreyMSSchafer@gmail.com       33
1   Jane      Doe         JaneDoe@gmail.com       55
2   John      Doe         JohnDoe@gmail.com       63
3  Chris  Schafer                      None       36
5   None      NaN       Anonymous@gmail.com     None
6     NA  Missing                        NA  Missing

In [11]:
df

   first     last                     email      age
0  Corey  Schafer  CoreyMSSchafer@gmail.com       33
1   Jane      Doe         JaneDoe@gmail.com       55
2   John      Doe         JohnDoe@gmail.com       63
3  Chris  Schafer                      None       36
4    NaN      NaN                       NaN     None
5   None      NaN       Anonymous@gmail.com     None
6     NA  Missing                        NA  Missing

In [12]:
# Replacing custom 'NA' and 'Missing' with numpy 'NA'
df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [13]:
df

   first     last                     email   age
0  Corey  Schafer  CoreyMSSchafer@gmail.com    33
1   Jane      Doe         JaneDoe@gmail.com    55
2   John      Doe         JohnDoe@gmail.com    63
3  Chris  Schafer                      None    36
4    NaN      NaN                       NaN  None
5   None      NaN       Anonymous@gmail.com  None
6    NaN      NaN                       NaN   NaN

In [14]:
df.dropna()

   first     last                     email age
0  Corey  Schafer  CoreyMSSchafer@gmail.com  33
1   Jane      Doe         JaneDoe@gmail.com  55
2   John      Doe         JohnDoe@gmail.com  63

In [15]:
df.dropna(axis='index', how='all', subset=['last', 'email'])

   first     last                     email   age
0  Corey  Schafer  CoreyMSSchafer@gmail.com    33
1   Jane      Doe         JaneDoe@gmail.com    55
2   John      Doe         JohnDoe@gmail.com    63
3  Chris  Schafer                      None    36
5   None      NaN       Anonymous@gmail.com  None

In [16]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [17]:
df.fillna('MISSING')

     first     last                     email      age
0    Corey  Schafer  CoreyMSSchafer@gmail.com       33
1     Jane      Doe         JaneDoe@gmail.com       55
2     John      Doe         JohnDoe@gmail.com       63
3    Chris  Schafer                   MISSING       36
4  MISSING  MISSING                   MISSING  MISSING
5  MISSING  MISSING       Anonymous@gmail.com  MISSING
6  MISSING  MISSING                   MISSING  MISSING

In [18]:
df.fillna(0)

   first     last                     email age
0  Corey  Schafer  CoreyMSSchafer@gmail.com  33
1   Jane      Doe         JaneDoe@gmail.com  55
2   John      Doe         JohnDoe@gmail.com  63
3  Chris  Schafer                         0  36
4      0        0                         0   0
5      0        0       Anonymous@gmail.com   0
6      0        0                         0   0

In [19]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [20]:
type(np.nan)

float

In [21]:
df['age'] = df['age'].astype(float)

In [22]:
df['age'].mean()

46.75

In [23]:
na_vals = ['NA', 'Missing']
df = pd.read_csv('../data/2019/survey_results_public.csv', na_values=na_vals)
schema_df = pd.read_csv('../data/2019/survey_results_schema.csv')

In [24]:
df['YearsCode'].head(50)

0                    4
1                  NaN
2                    3
3                    3
4                   16
5                   13
6                    6
7                    8
8                   12
9                   12
10                   2
11                   5
12                  17
13                  13
14                   3
15                  10
16                   5
17                  10
18                  14
19                   8
20                   5
21                  35
22                   3
23                   2
24                   2
25                  12
26                   7
27                  10
28                   4
29                   6
30    Less than 1 year
31                   3
32                   6
33    Less than 1 year
34                  14
35                  10
36                   7
37                  30
38                  30
39                   5
40                   4
41                   8
42                   9
43                  26
44                  40
45                  19
46                  35
47                   2
48                  15
49                   7
Name: YearsCode, dtype: object

In [25]:
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [26]:
df['YearsCode'].replace('Less than 1 year', 0, inplace=True)

In [27]:
df['YearsCode'].replace('More than 50 years', 51, inplace=True)

In [28]:
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 0, '30', '9', '26', '40', '19', '15', '20', '28',
       '25', '1', '22', '11', '33', '50', '41', '18', '34', '24', '23',
       '42', '27', '21', '36', '32', '39', '38', '31', '37', 51, '29',
       '44', '45', '48', '46', '43', '47', '49'], dtype=object)

In [29]:
df['YearsCode'] = df['YearsCode'].astype(float)

In [30]:
df['YearsCode'].unique()

array([ 4., nan,  3., 16., 13.,  6.,  8., 12.,  2.,  5., 17., 10., 14.,
       35.,  7.,  0., 30.,  9., 26., 40., 19., 15., 20., 28., 25.,  1.,
       22., 11., 33., 50., 41., 18., 34., 24., 23., 42., 27., 21., 36.,
       32., 39., 38., 31., 37., 51., 29., 44., 45., 48., 46., 43., 47.,
       49.])

In [31]:
df['YearsCode'].mean()

11.662114216834588

In [32]:
df['YearsCode'].median()

9.0